espressif/esp-idf/components/soc/esp32s31/include/modem/modem_lpcon_reg.h
#define MODEM_LPCON_MEM_RF2_AUX_CTRL_REG          (DR_REG_MODEM_LPCON_BASE + 0x34)
/* MODEM_LPCON_MODEM_PWR_RF2_AUX_CTRL : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: .*/
#define MODEM_LPCON_MODEM_PWR_RF2_AUX_CTRL    0xFFFFFFFF
#define MODEM_LPCON_MODEM_PWR_RF2_AUX_CTRL_M  ((MODEM_LPCON_MODEM_PWR_RF2_AUX_CTRL_V)<<(MODEM_LPCON_MODEM_PWR_RF2_AUX_CTRL_S))
#define MODEM_LPCON_MODEM_PWR_RF2_AUX_CTRL_V  0xFFFFFFFF
#define MODEM_LPCON_MODEM_PWR_RF2_AUX_CTRL_S  0

#define MODEM_LPCON_APB_MEM_SEL_REG          (DR_REG_MODEM_LPCON_BASE + 0x38)
/* MODEM_LPCON_PWR_MEM_BASE : R/W ;bitpos:[19:4] ;default: 16'b0 ; */
/*description: .*/
#define MODEM_LPCON_PWR_MEM_BASE    0x0000FFFF
#define MODEM_LPCON_PWR_MEM_BASE_M  ((MODEM_LPCON_PWR_MEM_BASE_V)<<(MODEM_LPCON_PWR_MEM_BASE_S))
#define MODEM_LPCON_PWR_MEM_BASE_V  0xFFFF
#define MODEM_LPCON_PWR_MEM_BASE_S  4
/* MODEM_LPCON_CFR_MEM_EN : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: .*/
#define MODEM_LPCON_CFR_MEM_EN    (BIT(3))
#define MODEM_LPCON_CFR_MEM_EN_M  (BIT(3))
#define MODEM_LPCON_CFR_MEM_EN_V  0x1
#define MODEM_LPCON_CFR_MEM_EN_S  3
/* MODEM_LPCON_AGC_MEM_EN : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: .*/
#define MODEM_LPCON_AGC_MEM_EN    (BIT(2))
#define MODEM_LPCON_AGC_MEM_EN_M  (BIT(2))
#define MODEM_LPCON_AGC_MEM_EN_V  0x1
#define MODEM_LPCON_AGC_MEM_EN_S  2
/* MODEM_LPCON_PBUS_MEM_EN : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: .*/
#define MODEM_LPCON_PBUS_MEM_EN    (BIT(1))
#define MODEM_LPCON_PBUS_MEM_EN_M  (BIT(1))
#define MODEM_LPCON_PBUS_MEM_EN_V  0x1
#define MODEM_LPCON_PBUS_MEM_EN_S  1
/* MODEM_LPCON_CHAN_FREQ_MEM_EN : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: .*/
#define MODEM_LPCON_CHAN_FREQ_MEM_EN    (BIT(0))
#define MODEM_LPCON_CHAN_FREQ_MEM_EN_M  (BIT(0))
#define MODEM_LPCON_CHAN_FREQ_MEM_EN_V  0x1
#define MODEM_LPCON_CHAN_FREQ_MEM_EN_S  0

#define MODEM_LPCON_DCMEM_VALID_0_REG          (DR_REG_MODEM_LPCON_BASE + 0x3C)
/* MODEM_LPCON_DCMEM_VALID_0 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: .*/
#define MODEM_LPCON_DCMEM_VALID_0    0xFFFFFFFF
#define MODEM_LPCON_DCMEM_VALID_0_M  ((MODEM_LPCON_DCMEM_VALID_0_V)<<(MODEM_LPCON_DCMEM_VALID_0_S))
#define MODEM_LPCON_DCMEM_VALID_0_V  0xFFFFFFFF
#define MODEM_LPCON_DCMEM_VALID_0_S  0

#define MODEM_LPCON_DCMEM_VALID_1_REG          (DR_REG_MODEM_LPCON_BASE + 0x40)
/* MODEM_LPCON_DCMEM_VALID_1 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: .*/
#define MODEM_LPCON_DCMEM_VALID_1    0xFFFFFFFF
#define MODEM_LPCON_DCMEM_VALID_1_M  ((MODEM_LPCON_DCMEM_VALID_1_V)<<(MODEM_LPCON_DCMEM_VALID_1_S))
#define MODEM_LPCON_DCMEM_VALID_1_V  0xFFFFFFFF
#define MODEM_LPCON_DCMEM_VALID_1_S  0

#define MODEM_LPCON_DCMEM_VALID_2_REG          (DR_REG_MODEM_LPCON_BASE + 0x44)
/* MODEM_LPCON_DCMEM_VALID_2 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: .*/
#define MODEM_LPCON_DCMEM_VALID_2    0xFFFFFFFF
#define MODEM_LPCON_DCMEM_VALID_2_M  ((MODEM_LPCON_DCMEM_VALID_2_V)<<(MODEM_LPCON_DCMEM_VALID_2_S))
#define MODEM_LPCON_DCMEM_VALID_2_V  0xFFFFFFFF
#define MODEM_LPCON_DCMEM_VALID_2_S  0

#define MODEM_LPCON_DCMEM_VALID_3_REG          (DR_REG_MODEM_LPCON_BASE + 0x48)
/* MODEM_LPCON_DCMEM_VALID_3 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: .*/
#define MODEM_LPCON_DCMEM_VALID_3    0xFFFFFFFF
#define MODEM_LPCON_DCMEM_VALID_3_M  ((MODEM_LPCON_DCMEM_VALID_3_V)<<(MODEM_LPCON_DCMEM_VALID_3_S))
#define MODEM_LPCON_DCMEM_VALID_3_V  0xFFFFFFFF
#define MODEM_LPCON_DCMEM_VALID_3_S  0

#define MODEM_LPCON_MODEM_INTR_WAKEUP_CONF_REG          (DR_REG_MODEM_LPCON_BASE + 0x4C)
/* MODEM_LPCON_BT_MAC_INT1_WAKEUP_EN : R/W ;bitpos:[13] ;default: 1'b1 ; */
/*description: .*/
#define MODEM_LPCON_BT_MAC_INT1_WAKEUP_EN    (BIT(13))
#define MODEM_LPCON_BT_MAC_INT1_WAKEUP_EN_M  (BIT(13))
#define MODEM_LPCON_BT_MAC_INT1_WAKEUP_EN_V  0x1
#define MODEM_LPCON_BT_MAC_INT1_WAKEUP_EN_S  13
/* MODEM_LPCON_ZB_MAC_INTR_WAKEUP_EN : R/W ;bitpos:[12] ;default: 1'b1 ; */
/*description: .*/
#define MODEM_LPCON_ZB_MAC_INTR_WAKEUP_EN    (BIT(12))
#define MODEM_LPCON_ZB_MAC_INTR_WAKEUP_EN_M  (BIT(12))
#define MODEM_LPCON_ZB_MAC_INTR_WAKEUP_EN_V  0x1
#define MODEM_LPCON_ZB_MAC_INTR_WAKEUP_EN_S  12
/* MODEM_LPCON_I2C_MST_INTR_WAKEUP_EN : R/W ;bitpos:[11] ;default: 1'b1 ; */
/*description: .*/
#define MODEM_LPCON_I2C_MST_INTR_WAKEUP_EN    (BIT(11))
#define MODEM_LPCON_I2C_MST_INTR_WAKEUP_EN_M  (BIT(11))
#define MODEM_LPCON_I2C_MST_INTR_WAKEUP_EN_V  0x1
#define MODEM_LPCON_I2C_MST_INTR_WAKEUP_EN_S  11
/* MODEM_LPCON_BLE_SEC_INTR_WAKEUP_EN : R/W ;bitpos:[10] ;default: 1'b1 ; */
/*description: .*/
#define MODEM_LPCON_BLE_SEC_INTR_WAKEUP_EN    (BIT(10))
#define MODEM_LPCON_BLE_SEC_INTR_WAKEUP_EN_M  (BIT(10))
#define MODEM_LPCON_BLE_SEC_INTR_WAKEUP_EN_V  0x1
#define MODEM_LPCON_BLE_SEC_INTR_WAKEUP_EN_S  10
/* MODEM_LPCON_BLE_TIMER_INTR_WAKEUP_EN : R/W ;bitpos:[9] ;default: 1'b1 ; */
/*description: .*/
#define MODEM_LPCON_BLE_TIMER_INTR_WAKEUP_EN    (BIT(9))
#define MODEM_LPCON_BLE_TIMER_INTR_WAKEUP_EN_M  (BIT(9))
#define MODEM_LPCON_BLE_TIMER_INTR_WAKEUP_EN_V  0x1
#define MODEM_LPCON_BLE_TIMER_INTR_WAKEUP_EN_S  9
/* MODEM_LPCON_COEX_INTR_WAKEUP_EN : R/W ;bitpos:[8] ;default: 1'b1 ; */
/*description: .*/
#define MODEM_LPCON_COEX_INTR_WAKEUP_EN    (BIT(8))
#define MODEM_LPCON_COEX_INTR_WAKEUP_EN_M  (BIT(8))
#define MODEM_LPCON_COEX_INTR_WAKEUP_EN_V  0x1
#define MODEM_LPCON_COEX_INTR_WAKEUP_EN_S  8
/* MODEM_LPCON_LP_TIMER_INTR_WAKEUP_EN : R/W ;bitpos:[7] ;default: 1'b1 ; */
/*description: .*/
#define MODEM_LPCON_LP_TIMER_INTR_WAKEUP_EN    (BIT(7))
#define MODEM_LPCON_LP_TIMER_INTR_WAKEUP_EN_M  (BIT(7))
#define MODEM_LPCON_LP_TIMER_INTR_WAKEUP_EN_V  0x1
#define MODEM_LPCON_LP_TIMER_INTR_WAKEUP_EN_S  7
/* MODEM_LPCON_BT_BB_NMI_WAKEUP_EN : R/W ;bitpos:[6] ;default: 1'b1 ; */
/*description: .*/
#define MODEM_LPCON_BT_BB_NMI_WAKEUP_EN    (BIT(6))
#define MODEM_LPCON_BT_BB_NMI_WAKEUP_EN_M  (BIT(6))
#define MODEM_LPCON_BT_BB_NMI_WAKEUP_EN_V  0x1
#define MODEM_LPCON_BT_BB_NMI_WAKEUP_EN_S  6
/* MODEM_LPCON_BT_BB_INTR_WAKEUP_EN : R/W ;bitpos:[5] ;default: 1'b1 ; */
/*description: .*/
#define MODEM_LPCON_BT_BB_INTR_WAKEUP_EN    (BIT(5))
#define MODEM_LPCON_BT_BB_INTR_WAKEUP_EN_M  (BIT(5))
#define MODEM_LPCON_BT_BB_INTR_WAKEUP_EN_V  0x1
#define MODEM_LPCON_BT_BB_INTR_WAKEUP_EN_S  5
/* MODEM_LPCON_BT_MAC_INTR_WAKEUP_EN : R/W ;bitpos:[4] ;default: 1'b1 ; */
/*description: .*/
#define MODEM_LPCON_BT_MAC_INTR_WAKEUP_EN    (BIT(4))
#define MODEM_LPCON_BT_MAC_INTR_WAKEUP_EN_M  (BIT(4))
#define MODEM_LPCON_BT_MAC_INTR_WAKEUP_EN_V  0x1
#define MODEM_LPCON_BT_MAC_INTR_WAKEUP_EN_S  4
/* MODEM_LPCON_WIFI_BB_INTR_WAKEUP_EN : R/W ;bitpos:[3] ;default: 1'b1 ; */
/*description: .*/
#define MODEM_LPCON_WIFI_BB_INTR_WAKEUP_EN    (BIT(3))
#define MODEM_LPCON_WIFI_BB_INTR_WAKEUP_EN_M  (BIT(3))
#define MODEM_LPCON_WIFI_BB_INTR_WAKEUP_EN_V  0x1
#define MODEM_LPCON_WIFI_BB_INTR_WAKEUP_EN_S  3
/* MODEM_LPCON_WIFI_PWR_INTR_WAKEUP_EN : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: .*/
#define MODEM_LPCON_WIFI_PWR_INTR_WAKEUP_EN    (BIT(2))
#define MODEM_LPCON_WIFI_PWR_INTR_WAKEUP_EN_M  (BIT(2))
#define MODEM_LPCON_WIFI_PWR_INTR_WAKEUP_EN_V  0x1
#define MODEM_LPCON_WIFI_PWR_INTR_WAKEUP_EN_S  2
/* MODEM_LPCON_WIFI_MAC_NMI_WAKEUP_EN : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: .*/
#define MODEM_LPCON_WIFI_MAC_NMI_WAKEUP_EN    (BIT(1))
#define MODEM_LPCON_WIFI_MAC_NMI_WAKEUP_EN_M  (BIT(1))
#define MODEM_LPCON_WIFI_MAC_NMI_WAKEUP_EN_V  0x1
#define MODEM_LPCON_WIFI_MAC_NMI_WAKEUP_EN_S  1
/* MODEM_LPCON_WIFI_MAC_INTR_WAKEUP_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: .*/
#define MODEM_LPCON_WIFI_MAC_INTR_WAKEUP_EN    (BIT(0))
#define MODEM_LPCON_WIFI_MAC_INTR_WAKEUP_EN_M  (BIT(0))
#define MODEM_LPCON_WIFI_MAC_INTR_WAKEUP_EN_V  0x1
#define MODEM_LPCON_WIFI_MAC_INTR_WAKEUP_EN_S  0

#define MODEM_LPCON_MODEM_INTR_STATUS_REG          (DR_REG_MODEM_LPCON_BASE + 0x50)
/* MODEM_LPCON_MODEM_INTR_VECTOR : RO ;bitpos:[13:0] ;default: 14'h0 ; */
/*description: .*/
#define MODEM_LPCON_MODEM_INTR_VECTOR    0x00003FFF
#define MODEM_LPCON_MODEM_INTR_VECTOR_M  ((MODEM_LPCON_MODEM_INTR_VECTOR_V)<<(MODEM_LPCON_MODEM_INTR_VECTOR_S))
#define MODEM_LPCON_MODEM_INTR_VECTOR_V  0x3FFF
#define MODEM_LPCON_MODEM_INTR_VECTOR_S  0

#define MODEM_LPCON_MEM_CONF2_REG          (DR_REG_MODEM_LPCON_BASE + 0x54)
/* MODEM_LPCON_PWR_MEM_MODE_SEL : R/W ;bitpos:[3:0] ;default: 4'b0100 ; */
/*description: .*/
#define MODEM_LPCON_PWR_MEM_MODE_SEL    0x0000000F
#define MODEM_LPCON_PWR_MEM_MODE_SEL_M  ((MODEM_LPCON_PWR_MEM_MODE_SEL_V)<<(MODEM_LPCON_PWR_MEM_MODE_SEL_S))
#define MODEM_LPCON_PWR_MEM_MODE_SEL_V  0xF
#define MODEM_LPCON_PWR_MEM_MODE_SEL_S  0

#define MODEM_LPCON_DATE_REG          (DR_REG_MODEM_LPCON_BASE + 0x58)
/* MODEM_LPCON_DATE : R/W ;bitpos:[27:0] ;default: 28'h2508150 ; */
/*description: .*/
#define MODEM_LPCON_DATE    0x0FFFFFFF
#define MODEM_LPCON_DATE_M  ((MODEM_LPCON_DATE_V)<<(MODEM_LPCON_DATE_S))
#define MODEM_LPCON_DATE_V  0xFFFFFFF
#define MODEM_LPCON_DATE_S  0

#ifdef __cplusplus
}
#endif
